Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.app.notificationBadgePosition.subtitle
source: Show the unread notification badge on the left or the right of the workspace row.
ar: إظهار شارة الإشعارات غير المقروءة على يسار صف مساحة العمل أو على يمينه.
bs: Prikazuje značku nepročitanih obavijesti lijevo ili desno u redu radnog prostora.
da: Viser ulæst-notifikationsmærket til venstre eller højre i arbejdsområdets række.
de: Zeigt die Ungelesen-Plakette links oder rechts in der Arbeitsbereichszeile.
es: Muestra la insignia de notificaciones no leídas a la izquierda o a la derecha de la fila del espacio de trabajo.
fr: Affiche le badge de notifications non lues à gauche ou à droite de la ligne de l’espace de travail.
it: Mostra il badge delle notifiche non lette a sinistra o a destra della riga dello spazio di lavoro.
ja: 未読通知バッジをワークスペース行の左または右に表示します。
ko: 읽지 않은 알림 배지를 워크스페이스 행의 왼쪽 또는 오른쪽에 표시합니다.
nb: Viser ulest-varselmerket til venstre eller høyre i arbeidsområderaden.
pl: Pokazuje plakietkę nieprzeczytanych powiadomień po lewej lub prawej stronie wiersza obszaru roboczego.
pt_br: Mostra o selo de notificações não lidas à esquerda ou à direita da linha do espaço de trabalho.
ru: Показывает значок непрочитанных уведомлений слева или справа в строке рабочего пространства.
th: แสดงป้ายการแจ้งเตือนที่ยังไม่ได้อ่านทางซ้ายหรือทางขวาของแถวเวิร์กสเปซ
tr: Okunmamış bildirim rozetini çalışma alanı satırının solunda veya sağında gösterir.
uk: Показує значок непрочитаних сповіщень ліворуч або праворуч у рядку робочого простору.
zh_hans: 在工作区行的左侧或右侧显示未读通知标记。
zh_hant: 在工作區列的左側或右側顯示未讀通知標記。

# settings.app.notificationMessageLineLimit
source: Notification Preview Lines
ar: سطور معاينة الإشعارات
de: Vorschauzeilen für Benachrichtigungen
es: Líneas de previsualización de notificaciones
fr: Lignes d’aperçu des notifications
ja: 通知プレビューの行数
ko: 알림 미리보기 줄 수
zh_hans: 通知预览行数
zh_hant: 通知預覽行數

# settings.app.notificationMessageLineLimit.subtitle
source: Maximum lines shown for the latest notification below each workspace title.
ar: الحد الأقصى للسطور المعروضة لآخر إشعار تحت كل عنوان مساحة عمل.
de: Maximale Anzahl an Zeilen, die für die neueste Benachrichtigung unter jedem Arbeitsbereich-Titel angezeigt werden.
es: Número máximo de líneas que se muestran para la última notificación debajo del título de cada espacio de trabajo.
fr: Nombre maximal de lignes affichées pour la dernière notification sous chaque titre d’espace de travail.
ja: 各ワークスペース名の下に表示する最新通知の最大行数です。
ko: 각 작업 공간 제목 아래에 표시되는 최근 알림의 최대 줄 수입니다.
zh_hans: 每个工作区标题下方最新通知显示的最大行数。
zh_hant: 每個工作區標題下方顯示之最新通知的最大行數。

# settings.app.openMarkdownInCmuxViewer
source: Open Markdown in cmux Viewer
ar: فتح Markdown في عارض cmux
de: Markdown im cmux-Viewer öffnen
es: Abrir Markdown en el visor cmux
fr: Ouvrir Markdown dans la visionneuse cmux
it: Apri Markdown nel visualizzatore cmux
ja: cmux ビューアで Markdown を開く
ko: cmux 뷰어에서 Markdown 열기
zh_hans: 在 cmux 查看器中打开 Markdown
zh_hant: 在 cmux 檢視器中開啟 Markdown

# settings.app.openMarkdownInCmuxViewer.subtitle
source: Cmd-clicking Markdown files opens the rendered cmux markdown viewer instead of the generic file preview.
ar: يؤدي النقر مع الضغط على مفتاح Cmd على ملفات Markdown إلى فتح عارض cmux لـ markdown المصير بدلاً من المعاينة العامة للملف.
de: Cmd-Klick auf Markdown-Dateien öffnet den gerenderten cmux-Markdown-Viewer statt der allgemeinen Dateivorschau.
es: Hacer Cmd+clic en archivos Markdown abre el visor de Markdown renderizado de cmux en lugar de la vista previa genérica de archivos.
fr: Cmd+clic sur les fichiers Markdown ouvre la visionneuse Markdown rendue de cmux au lieu de l'aperçu générique des fichiers.
it: Cmd+clic sui file Markdown apre il visualizzatore Markdown renderizzato di cmux invece dell'anteprima file generica.
ja: Markdown ファイルを Cmd+クリックすると、汎用ファイルプレビューではなくレンダリング済みの cmux マークダウンビューアで開きます。
ko: Markdown 파일을 Cmd+클릭하면 일반 파일 미리보기 대신 렌더링된 cmux Markdown 뷰어에서 열립니다.
zh_hans: Cmd+点击 Markdown 文件会在渲染后的 cmux Markdown 查看器中打开，而不是通用文件预览。
zh_hant: Cmd+點擊 Markdown 檔案會在轉譯後的 cmux Markdown 檢視器中開啟，而不是通用檔案預覽。

# settings.app.openSidebarPRLinks
source: Open Sidebar PR Links in cmux Browser
ar: فتح روابط طلبات السحب في متصفح cmux
bs: Otvori PR linkove iz bočne trake u cmux pregledniku
da: Åbn sidebjælkens PR-links i cmux-browser
de: Seitenleisten-PR-Links im cmux-Browser öffnen
es: Abrir enlaces de PR de la barra lateral en el navegador de cmux
fr: Ouvrir les liens PR de la barre latérale dans le navigateur cmux
it: Apri link PR della barra laterale nel browser cmux
ja: サイドバーのPRリンクをcmuxブラウザで開く
ko: 사이드바 PR 링크를 cmux 브라우저에서 열기
nb: Åpne sidepanel-PR-lenker i cmux-nettleser
pl: Otwieraj linki PR z paska bocznego w przeglądarce cmux
pt_br: Abrir Links de PR da Barra Lateral no Navegador do cmux
ru: Открывать ссылки PR боковой панели в браузере cmux
th: เปิดลิงก์ PR ในแถบด้านข้างด้วยเบราว์เซอร์ cmux
tr: Kenar Çubuğu PR Bağlantılarını cmux Tarayıcısında Aç
uk: Відкривати PR-посилання бічної панелі у браузері cmux
zh_hans: 在 cmux 浏览器中打开侧边栏 PR 链接
zh_hant: 在 cmux 瀏覽器中開啟側邊欄 PR 連結

# settings.app.openSidebarPRLinks.subtitleDisabled
source: Enable sidebar PR clickability to choose where PR links open.
ar: تمكين قابلية النقر على طلبات السحب في الشريط الجانبي لاختيار مكان فتح روابط طلبات السحب.
de: Klickbarkeit für PRs in der Seitenleiste aktivieren, um auszuwählen, wo PR-Links geöffnet werden.
es: Habilita la interactividad de PR en la barra lateral para elegir dónde se abren los enlaces de PR.
fr: Activer la possibilité de cliquer sur les PR de la barre latérale pour choisir où s’ouvrent leurs liens.
ja: PRリンクの開き先を選ぶには、サイドバーのPRクリックを有効にしてください。
ko: 사이드바 PR 클릭을 활성화하여 PR 링크가 열리는 위치를 선택하세요.
zh_hans: 启用侧边栏 PR 可点击后，才能选择 PR 链接的打开位置。
zh_hant: 啟用側邊欄 PR 可點擊功能以選擇開啟 PR 連結的位置。

# settings.app.openSidebarPRLinks.subtitleHidden
source: Enable sidebar PR visibility to choose where PR links open.
ar: تمكين رؤية طلبات السحب في الشريط الجانبي لاختيار مكان فتح روابط طلبات السحب.
de: Sichtbarkeit für PRs in der Seitenleiste aktivieren, um auszuwählen, wo PR-Links geöffnet werden.
es: Habilita la visibilidad de PR en la barra lateral para elegir dónde se abren los enlaces de PR.
fr: Activer la visibilité des PR de la barre latérale pour choisir où s’ouvrent leurs liens.
ja: PRリンクの開き先を選ぶには、サイドバーのPR表示を有効にしてください。
ko: 사이드바 PR 표시를 활성화하여 PR 링크가 열리는 위치를 선택하세요.
zh_hans: 启用侧边栏 PR 显示后，才能选择 PR 链接的打开位置。
zh_hant: 啟用側邊欄 PR 可見性以選擇開啟 PR 連結的位置。

# settings.app.openSidebarPRLinks.subtitleOff
source: Clicks open in your default browser.
ar: النقرات تفتح في متصفحك الافتراضي.
bs: Klikovi se otvaraju u podrazumijevanom pregledniku.
da: Klik åbner i din standardbrowser.
de: Klicks öffnen in Ihrem Standardbrowser.
es: Los clics abren en tu navegador predeterminado.
fr: Les clics ouvrent dans votre navigateur par défaut.
it: I clic aprono nel browser predefinito.
ja: クリックするとデフォルトブラウザで開きます。
ko: 클릭하면 기본 브라우저에서 열립니다.
nb: Klikk åpner i standard nettleser.
pl: Kliknięcia otwierają w domyślnej przeglądarce.
pt_br: Cliques abrem no seu navegador padrão.
ru: Ссылки открываются в браузере по умолчанию.
th: คลิกจะเปิดในเบราว์เซอร์เริ่มต้นของคุณ
tr: Tıklamalar varsayılan tarayıcınızda açılır.
uk: Кліки відкриваються у стандартному браузері.
zh_hans: 点击在默认浏览器中打开。
zh_hant: 點擊會在您的預設瀏覽器中開啟。

# settings.app.openSidebarPRLinks.subtitleOn
source: Clicks open inside cmux browser.
ar: النقرات تفتح داخل متصفح cmux.
bs: Klikovi se otvaraju unutar cmux preglednika.
da: Klik åbner i cmux-browseren.
de: Klicks öffnen im cmux-Browser.
es: Los clics abren dentro del navegador de cmux.
fr: Les clics ouvrent dans le navigateur cmux.
it: I clic aprono nel browser cmux.
ja: クリックするとcmuxブラウザ内で開きます。
ko: 클릭하면 cmux 브라우저에서 열립니다.
nb: Klikk åpner i cmux-nettleseren.
pl: Kliknięcia otwierają w przeglądarce cmux.
pt_br: Cliques abrem dentro do navegador do cmux.
ru: Ссылки открываются во встроенном браузере cmux.
th: คลิกจะเปิดในเบราว์เซอร์ cmux
tr: Tıklamalar cmux tarayıcısında açılır.
uk: Кліки відкриваються у браузері cmux.
zh_hans: 点击在 cmux 浏览器中打开。
zh_hant: 點擊會在 cmux 瀏覽器中開啟。

# settings.app.openSidebarPortLinks
source: Open Sidebar Port Links in cmux Browser
ar: فتح روابط المنافذ في متصفح cmux
bs: Otvori port linkove iz bočne trake u cmux pregledniku
da: Åbn sidebjælkens portlinks i cmux-browser
de: Seitenleisten-Port-Links im cmux-Browser öffnen
es: Abrir enlaces de puerto de la barra lateral en el navegador de cmux
fr: Ouvrir les liens de port de la barre latérale dans le navigateur cmux
it: Apri link delle porte della barra laterale nel browser cmux
ja: サイドバーのポートリンクをcmuxブラウザで開く
ko: 사이드바 포트 링크를 cmux 브라우저에서 열기
nb: Åpne sidepanel-portlenker i cmux-nettleser
pl: Otwieraj linki portów z paska bocznego w przeglądarce cmux
pt_br: Abrir Links de Porta da Barra Lateral no Navegador do cmux
ru: Открывать ссылки портов боковой панели в браузере cmux
th: เปิดลิงก์พอร์ตในแถบด้านข้างด้วยเบราว์เซอร์ cmux
tr: Kenar Çubuğu Port Bağlantılarını cmux Tarayıcısında Aç
uk: Відкривати посилання портів бічної панелі у браузері cmux
zh_hans: 在 cmux 浏览器中打开侧边栏端口链接
zh_hant: 在 cmux 瀏覽器中開啟側邊欄連接埠連結

# settings.app.openSidebarPortLinks.subtitleOff
source: Port clicks open in your default browser.
ar: نقرات المنافذ تفتح في متصفحك الافتراضي.
bs: Klikovi na portove se otvaraju u podrazumijevanom pregledniku.
da: Portklik åbner i din standardbrowser.
de: Port-Klicks öffnen in Ihrem Standardbrowser.
es: Los clics en puertos abren en tu navegador predeterminado.
fr: Les clics de port ouvrent dans votre navigateur par défaut.
it: I clic sulle porte aprono nel browser predefinito.
ja: ポートをクリックするとデフォルトブラウザで開きます。
ko: 포트를 클릭하면 기본 브라우저에서 열립니다.
nb: Portklikk åpner i standard nettleser.
pl: Kliknięcia portów otwierają w domyślnej przeglądarce.
pt_br: Cliques em portas abrem no seu navegador padrão.
ru: Ссылки портов открываются в браузере по умолчанию.
th: คลิกพอร์ตจะเปิดในเบราว์เซอร์เริ่มต้นของคุณ
tr: Port tıklamaları varsayılan tarayıcınızda açılır.
uk: Кліки по портах відкриваються у стандартному браузері.
zh_hans: 端口点击在默认浏览器中打开。
zh_hant: 連接埠點擊會在您的預設瀏覽器中開啟。

# settings.app.openSidebarPortLinks.subtitleOn
source: Port clicks open inside cmux browser.
ar: نقرات المنافذ تفتح داخل متصفح cmux.
bs: Klikovi na portove se otvaraju unutar cmux preglednika.
da: Portklik åbner i cmux-browseren.
de: Port-Klicks öffnen im cmux-Browser.
es: Los clics en puertos abren dentro del navegador de cmux.
fr: Les clics de port ouvrent dans le navigateur cmux.
it: I clic sulle porte aprono nel browser cmux.
ja: ポートをクリックするとcmuxブラウザ内で開きます。
ko: 포트를 클릭하면 cmux 브라우저에서 열립니다.
nb: Portklikk åpner i cmux-nettleseren.
pl: Kliknięcia portów otwierają w przeglądarce cmux.
pt_br: Cliques em portas abrem dentro do navegador do cmux.
ru: Ссылки портов открываются во встроенном браузере cmux.
th: คลิกพอร์ตจะเปิดในเบราว์เซอร์ cmux
tr: Port tıklamaları cmux tarayıcısında açılır.
uk: Кліки по портах відкриваються у браузері cmux.
zh_hans: 端口点击在 cmux 浏览器中打开。
zh_hant: 連接埠點擊會在 cmux 瀏覽器中開啟。

# settings.app.openSupportedFilesInCmux
source: Open Supported Files in cmux
ar: فتح الملفات المدعومة في cmux
de: Unterstützte Dateien in cmux öffnen
es: Abrir archivos compatibles en cmux
fr: Ouvrir les fichiers pris en charge dans cmux
ja: 対応ファイルを cmux で開く
ko: 지원되는 파일을 cmux에서 열기
zh_hans: 在 cmux 中打开支持的文件
zh_hant: 在 cmux 中開啟支援的檔案

# settings.app.openSupportedFilesInCmux.subtitle
source: Cmd-clicking readable files opens text, code, PDFs, images, audio, video, and Quick Look previews in cmux.
ar: يؤدي النقر مع الضغط على مفتاح Cmd على الملفات القابلة للقراءة إلى فتح النصوص والتعليمات البرمجية وملفات PDF والصور والملفات الصوتية ومقاطع الفيديو ومعاينات نظرة سريعة (Quick Look) في cmux.
de: Cmd-Klick auf lesbare Dateien öffnet Text, Code, PDFs, Bilder, Audio, Video und Quick-Look-Vorschauen in cmux.
es: Hacer Cmd-clic en archivos legibles abre texto, código, archivos PDF, imágenes, audio, video y previsualizaciones de Quick Look en cmux.
fr: Cliquer sur un fichier lisible tout en maintenant la touche Cmd enfoncée ouvre du texte, du code, des PDF, des images, de l’audio, de la vidéo ainsi que des aperçus Coup d’œil dans cmux.
ja: 読み取り可能なファイルを Cmd+クリックすると、テキスト、コード、PDF、画像、音声、動画、Quick Look プレビューを cmux で開きます。
ko: 읽을 수 있는 파일을 Cmd-클릭하면 텍스트, 코드, PDF, 이미지, 오디오, 비디오 및 훑어보기(Quick Look) 미리보기가 cmux에서 열립니다.
zh_hans: Cmd+点击可读文件时，会在 cmux 中打开文本、代码、PDF、图片、音频、视频和快速查看预览。
zh_hant: 按住 Cmd 並點擊可讀檔案，即可在 cmux 中開啟文字、程式碼、PDF、圖片、音訊、影片和快速查看預覽。

# settings.app.paneFirstClickFocus
source: Focus Pane on First Click
ar: تركيز الجزء عند النقرة الأولى
de: Teilfenster beim ersten Klick fokussieren
es: Enfocar el panel al hacer el primer clic
fr: Placer le focus sur le volet au premier clic
ja: 最初のクリックでペインにフォーカス
ko: 첫 클릭으로 패인 포커스
uk: Фокус панелі при першому кліку
zh_hans: 首次点击即聚焦窗格
zh_hant: 第一次點擊時聚焦窗格

# settings.app.paneFirstClickFocus.subtitleOff
source: When cmux is inactive, the first click only activates the window. Click again to focus the pane.
ar: عندما يكون cmux غير نشط، فإن النقرة الأولى تنشط النافذة فقط. انقر مرة أخرى لتركيز الجزء.
de: Wenn cmux inaktiv ist, aktiviert der erste Klick nur das Fenster. Klicken Sie erneut, um das Teilfenster zu fokussieren.
es: Cuando cmux está inactivo, el primer clic solo activa la ventana. Haz clic de nuevo para enfocar el panel.
fr: Lorsque cmux est inactif, le premier clic active uniquement la fenêtre. Cliquez à nouveau pour placer le focus sur le volet.
ja: cmuxが非アクティブのとき、最初のクリックはウインドウをアクティブにするだけです。ペインにフォーカスするにはもう一度クリックします。
ko: cmux가 비활성 상태일 때, 첫 번째 클릭은 윈도우만 활성화합니다. 패인을 포커스하려면 다시 클릭하세요.
uk: Коли cmux неактивний, перший клік лише активує вікно. Клацніть ще раз, щоб сфокусувати панель.
zh_hans: cmux 未激活时，第一次点击只会激活窗口。需再点击一次才能聚焦窗格。
zh_hant: 當 cmux 處於非作用中狀態時，第一次點擊僅會啟用視窗。再次點擊以聚焦窗格。

# settings.app.paneFirstClickFocus.subtitleOn
source: When cmux is inactive, clicking a pane activates the window and focuses that pane in one click.
ar: عندما يكون cmux غير نشط، فإن النقر على جزء ينشط النافذة ويركز ذلك الجزء بنقرة واحدة.
de: Wenn cmux inaktiv ist, aktiviert das Klicken auf ein Teilfenster das Fenster und fokussiert dieses Teilfenster mit einem einzigen Klick.
es: Cuando cmux está inactivo, hacer clic en un panel activa la ventana y enfoca ese panel con un solo clic.
fr: Lorsque cmux est inactif, cliquer sur un volet active la fenêtre et place le focus sur ce volet en un seul clic.
ja: cmuxが非アクティブのとき、ペインをクリックすると1回でウインドウをアクティブにしてそのペインへフォーカスします。
ko: cmux가 비활성 상태일 때, 패인을 클릭하면 윈도우 활성화와 패인 포커스가 한 번에 이루어집니다.
uk: Коли cmux неактивний, клік на панель активує вікно та фокусує панель одним кліком.
zh_hans: cmux 未激活时，点击窗格会激活窗口并一次点击即聚焦该窗格。
zh_hant: 當 cmux 處於非作用中狀態時，點擊窗格會同時啟用視窗並聚焦該窗格。

# settings.app.pathLastSegmentOnly
source: Truncate Path From Start
ar: اقتطاع المسار من البداية
de: Pfad vom Anfang an kürzen
es: Truncar la ruta desde el inicio
fr: Tronquer le chemin depuis le début
ja: パスを先頭から省略
ko: 시작 부분부터 경로 자르기
zh_hans: 从开头截断路径
zh_hant: 從開頭截斷路徑

# settings.app.pathLastSegmentOnly.subtitleOff
source: Render full paths abbreviated with ~/.
ar: عرض المسارات الكاملة مختصرة بـ ~/.
de: Vollständige Pfade abgekürzt mit ~/ darstellen.
es: Muestra las rutas completas abreviadas con ~/.
fr: Afficher les chemins complets abrégés avec ~/.
ja: 完全なパスを ~/ で省略して表示します。
ko: ~/로 축약된 전체 경로를 렌더링합니다.
zh_hans: 以 ~/ 缩写形式渲染完整路径。
zh_hant: 轉譯以 ~/ 縮寫的完整路徑。

# settings.app.pathLastSegmentOnly.subtitleOn
source: Show as much of the trailing path as fits; shorter forms are prefixed with …/.
ar: إظهار أكبر قدر ممكن من الجزء الأخير من المسار؛ الأشكال الأقصر تبدأ بـ …/.
de: So viel des nachfolgenden Pfads anzeigen, wie hineinpasst; kürzere Formen erhalten das Präfix …/.
es: Muestra la mayor parte posible de la ruta final que quepa; las formas más cortas llevan el prefijo …/.
fr: Afficher autant de la fin du chemin que possible ; les formes plus courtes sont préfixées par …/.
ja: 末尾のパスを可能な限り表示し、短縮形には …/ を付けます。
ko: 길이에 맞춰 뒷부분 경로를 최대한 많이 표시하며, 더 짧은 형식에는 …/ 접두사가 붙습니다.
zh_hans: 尽可能多地显示路径末尾部分；被缩短的形式以 …/ 开头。
zh_hant: 顯示儘可能多的結尾路徑；較短的形式會加上 …/ 前綴。

# settings.app.preferredEditor
source: Open Files With
ar: فتح الملفات باستخدام
de: Dateien öffnen mit
es: Abrir archivos con
fr: Ouvrir les fichiers avec
ja: ファイルを開くアプリ
ko: 다음으로 파일 열기
zh_hans: 用什么打开文件
zh_hant: 開啟檔案方式

# settings.app.preferredEditor.placeholder
source: e.g. code, zed, subl
ar: على سبيل المثال: code، zed، subl
de: z. B. code, zed, subl
es: p. ej., code, zed, subl
fr: par ex. code, zed, subl
ja: 例: code、zed、subl
ko: 예: code, zed, subl
zh_hans: 例如 code、zed、subl
zh_hant: 例如 code, zed, subl

# settings.app.preferredEditor.subtitle
source: Command used when Cmd-click file previews are disabled or a file is unsupported. Leave empty for system default.
ar: الأمر المستخدم عند تعطيل معاينات الملفات عبر Cmd-click أو عندما يكون الملف غير مدعوم. اتركه فارغًا لاستخدام الخيار الافتراضي للنظام.
de: Befehl, der verwendet wird, wenn Cmd-Klick-Dateivorschauen deaktiviert sind oder eine Datei nicht unterstützt wird. Für Standardeinstellung des Systems leer lassen.
es: Comando utilizado cuando las previsualizaciones de archivos con Cmd-clic están deshabilitadas o un archivo no es compatible. Déjalo vacío para usar el valor predeterminado del sistema.
fr: Commande utilisée lorsque les aperçus de fichiers par Cmd-clic sont désactivés ou qu’un fichier n’est pas pris en charge. Laisser vide pour utiliser la valeur par défaut du système.
ja: Cmd+クリックのファイルプレビューが無効な場合、またはファイルが未対応の場合に使うコマンドです。空欄のままにするとシステムの既定で開きます。
ko: 파일의 Cmd-클릭 미리보기가 비활성화되어 있거나 지원되지 않는 파일일 때 사용할 명령입니다. 시스템 기본값을 사용하려면 비워 두세요.
zh_hans: 禁用 Cmd+点击文件预览或文件不受支持时使用的命令。留空则使用系统默认。
zh_hant: 當停用 Cmd+點擊檔案預覽或不支援檔案時所使用的命令。留空則使用系統預設值。

# settings.app.renameSelectsName
source: Rename Selects Existing Name
ar: إعادة التسمية تحدد الاسم الحالي
bs: Preimenovanje odabere postojeći naziv
da: Omdøbning markerer eksisterende navn
de: Umbenennen wählt vorhandenen Namen aus
es: Renombrar selecciona el nombre existente
fr: Le renommage sélectionne le nom existant
it: Rinomina seleziona il nome esistente
ja: 名称変更時に既存の名前を選択
ko: 이름 변경 시 기존 이름 선택
nb: Omdøping velger eksisterende navn
pl: Zmiana nazwy zaznacza istniejącą nazwę
pt_br: Renomear Seleciona o Nome Existente
ru: Переименование выделяет имя
th: เลือกชื่อเมื่อเปลี่ยนชื่อ
tr: Yeniden Adlandırma Mevcut Adı Seçer
uk: Виділяти назву при перейменуванні
zh_hans: 重命名时选中现有名称
zh_hant: 重新命名時選取現有名稱

# settings.app.renameSelectsName.subtitleOff
source: Command Palette rename keeps the caret at the end.
ar: إعادة التسمية في لوحة الأوامر تبقي المؤشر في النهاية.
bs: Preimenovanje u paleti naredbi zadržava kursor na kraju.
da: Omdøbning i kommandopaletten beholder markøren til sidst.
de: Beim Umbenennen in der Befehlspalette bleibt der Cursor am Ende.
es: Renombrar en la paleta de comandos mantiene el cursor al final.
fr: Le renommage via la palette de commandes maintient le curseur à la fin.
it: La rinomina nella Tavolozza comandi mantiene il cursore alla fine.
ja: コマンドパレットの名称変更ではキャレットが末尾に置かれます。
ko: 명령어 팔레트의 이름 변경 시 커서가 끝에 위치합니다.
nb: Omdøping i kommandopaletten beholder markøren på slutten.
pl: Zmiana nazwy w palecie poleceń pozostawia kursor na końcu.
pt_br: A renomeação na Paleta de Comandos mantém o cursor no final.
ru: Переименование в палитре команд оставляет курсор в конце.
th: การเปลี่ยนชื่อในแถบคำสั่งจะเก็บเคอร์เซอร์ไว้ที่ท้าย
tr: Komut Paleti yeniden adlandırması imleci sonda tutar.
uk: Перейменування в палітрі команд залишає курсор в кінці.
zh_hans: 命令面板重命名时光标保持在末尾。
zh_hant: 指令面板重新命名時，游標保持在結尾。

# settings.app.renameSelectsName.subtitleOn
source: Command Palette rename starts with all text selected.
ar: إعادة التسمية في لوحة الأوامر تبدأ بتحديد كل النص.
bs: Preimenovanje u paleti naredbi počinje sa svim odabranim tekstom.
da: Omdøbning i kommandopaletten starter med al tekst markeret.
de: Beim Umbenennen in der Befehlspalette wird der gesamte Text ausgewählt.
es: Cambiar el nombre desde la paleta de comandos comienza con todo el texto seleccionado.
fr: Le renommage via la palette de commandes commence avec tout le texte sélectionné.
it: La rinomina nella Tavolozza comandi inizia con tutto il testo selezionato.
ja: コマンドパレットの名称変更ではテキスト全体が選択された状態で始まります。
ko: 명령어 팔레트의 이름 변경 시 전체 텍스트가 선택됩니다.
nb: Omdøping i kommandopaletten starter med all tekst valgt.
pl: Zmiana nazwy w palecie poleceń rozpoczyna z zaznaczonym całym tekstem.
pt_br: A renomeação na Paleta de Comandos começa com todo o texto selecionado.
ru: Переименование в палитре команд начинается с выделения всего текста.
th: การเปลี่ยนชื่อในแถบคำสั่งจะเลือกข้อความทั้งหมด
tr: Komut Paleti yeniden adlandırması tüm metin seçili olarak başlar.
uk: Перейменування в палітрі команд починає з виділення всього тексту.
zh_hans: 命令面板重命名时全选文本。
zh_hant: 指令面板重新命名時，會先選取所有文字。

# settings.app.reorderOnNotification
source: Reorder on Notification
ar: إعادة الترتيب عند الإشعار
bs: Prerasporedi pri obavještenju
da: Omarranger ved notifikation
de: Bei Benachrichtigung neu sortieren
es: Reordenar al recibir notificación
fr: Réordonner à la notification
it: Riordina alla notifica
ja: 通知時に並べ替え
ko: 알림 시 순서 변경
nb: Omorganiser ved varsel
pl: Zmiana kolejności przy powiadomieniu
pt_br: Reordenar ao Receber Notificação
ru: Перемещение при уведомлении
th: จัดเรียงใหม่เมื่อมีการแจ้งเตือน
tr: Bildirimde Yeniden Sırala
uk: Переміщення при сповіщенні
zh_hans: 收到通知时重新排序
zh_hant: 收到通知時重新排序

# settings.app.reorderOnNotification.subtitle
source: Move workspaces to the top when they receive a notification. Disable for stable shortcut positions.
ar: نقل مساحات العمل إلى الأعلى عند تلقي إشعار. قم بالتعطيل للحفاظ على مواضع الاختصارات الثابتة.
bs: Pomjeri radne prostore na vrh kada prime obavještenje. Onemogućite za stabilne pozicije prečica.
da: Flyt arbejdsområder til toppen, når de modtager en notifikation. Deaktiver for stabile genvejspositioner.
de: Arbeitsbereiche nach oben verschieben, wenn sie eine Benachrichtigung erhalten. Deaktivieren Sie dies für stabile Tastenkürzel-Positionen.
es: Mover espacios de trabajo al inicio cuando reciben una notificación. Desactiva para posiciones de atajo estables.
fr: Déplacer les espaces de travail en haut lorsqu'ils reçoivent une notification. Désactivez pour des positions de raccourcis stables.
it: Sposta le aree di lavoro in cima quando ricevono una notifica. Disabilita per posizioni di scorciatoia stabili.
ja: 通知を受け取ったワークスペースを一番上に移動します。ショートカット位置を固定するには無効にしてください。
ko: 알림을 받은 작업 공간을 맨 위로 이동합니다. 단축키 위치를 고정하려면 비활성화하세요.
nb: Flytt arbeidsområder til toppen når de mottar et varsel. Deaktiver for stabile snarveiposisjoner.
pl: Przenoś przestrzenie robocze na górę, gdy otrzymają powiadomienie. Wyłącz, aby zachować stałe pozycje skrótów.
pt_br: Move áreas de trabalho para o topo ao receber uma notificação. Desative para posições de atalho estáveis.
ru: Перемещать рабочие пространства наверх при получении уведомления. Отключите для стабильных позиций сочетаний клавиш.
th: ย้ายเวิร์กสเปซไปด้านบนเมื่อได้รับการแจ้งเตือน ปิดใช้งานเพื่อให้ตำแหน่งทางลัดคงที่
tr: Bildirim aldıklarında çalışma alanlarını en üste taşı. Sabit kısayol konumları için devre dışı bırakın.
uk: Переміщувати робочі області нагору при отриманні сповіщення. Вимкніть для стабільних позицій комбінацій клавіш.
zh_hans: 收到通知时将工作区移至顶部。禁用以保持快捷键位置稳定。
zh_hant: 收到通知時將工作區移至最上方。停用此選項可維持穩定的快捷鍵位置。

# settings.app.settingsFile.openButton
source: Open cmux.json
ar: فتح cmux.json
de: cmux.json öffnen
es: Abrir cmux.json
fr: Ouvrir cmux.json
ja: cmux.jsonを開く
ko: cmux.json 열기
zh_hans: 打开 cmux.json
zh_hant: 開啟 cmux.json

# settings.app.showAgentActivity
source: Show Loading Spinner
ar: إظهار مؤشر التحميل
bs: Prikaži indikator učitavanja
da: Vis indlæsningsindikator
de: Ladeindikator anzeigen
es: Mostrar indicador de carga
fr: Afficher l’indicateur de chargement
it: Mostra indicatore di caricamento
ja: 読み込みスピナーを表示
ko: 로딩 스피너 표시
nb: Vis lasteindikator
pl: Pokaż wskaźnik ładowania
pt_br: Mostrar indicador de carregamento
ru: Показывать индикатор загрузки
th: แสดงตัวบ่งชี้การโหลด
tr: Yükleme göstergesini göster
uk: Показувати індикатор завантаження
zh_hans: 显示加载指示器
zh_hant: 顯示載入指示器
